update architecture and directory tree
